app/views/shared/_carousel.html.erb

    <ol class="carousel-indicators">
      <% Image.all.each_with_index do |image, index| %>
---
SELECT "images".* FROM "images"