app/views/pages/about_edit.html.erb

SELECT  "abouts".* FROM "abouts" ORDER BY "abouts"."id" DESC LIMIT $1  [["LIMIT", 1]]
---

    $('.about-section').each(function() {
        var target = $(this).offset().top;
        var id = $(this).attr('id');

        if (position >= target) {
            $('.about-sidenav a').removeClass('active');
            $('.about-sidenav a[href=#' + id + ']').addClass('active');
        }
    });