app/views/photos/index.html.erb


<% Image.all.each do |image| %>
---
SELECT "images".* FROM "images"