app/controllers/abouts_controller.rb

    def update

    @about = About.last

      if @about.update(about_params)
---
SELECT  "abouts".* FROM "abouts" ORDER BY "abouts"."id" DESC LIMIT $1  [["LIMIT", 1]]
UPDATE "abouts" SET "content" = $1, "updated_at" = $2 WHERE "abouts"."id" = $3