app/controllers/attractions_controller.rb

  def edit
    @attraction = Attraction.find(params[:id])
---
SELECT  "attractions".* FROM "attractions" WHERE "attractions"."id" = $1 LIMIT $2  [["id", 28], ["LIMIT", 1]]

  def update
    @attraction = Attraction.find(params[:id])
      if @attraction.update(attraction_params)
---
SELECT  "attractions".* FROM "attractions" WHERE "attractions"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
UPDATE "attractions" SET "address" = $1, "latitude" = $2, "longitude" = $3, "updated_at" = $4 WHERE "attractions"."id" = $5  [["address", "Eiffel Tower"], ["latitude", 48.85837009999999], ["longitude", 2.2944813], ["updated_at", "2018-04-16 20:14:21.347594"], ["id", 4]]

  def create
    @attraction = Attraction.new(attraction_params)
      if @attraction.save!
---
INSERT INTO "attractions" ("created_at", "updated_at") VALUES ($1, $2) RETURNING "id"  [["created_at", "2018-04-10 12:05:58.164250"], ["updated_at", "2018-04-10 12:05:58.164250"]]

  def destroy
    @attraction = Attraction.find(params[:id])
    @attraction.destroy
---
SELECT  "attractions".* FROM "attractions" WHERE "attractions"."id" = $1 LIMIT $2  [["id", 30], ["LIMIT", 1]]
DELETE FROM "attractions" WHERE "attractions"."id" = $1  [["id", 30]]