app/controllers/contactinfos_controller.rb

SELECT  "contactinfos".* FROM "contactinfos" ORDER BY "contactinfos"."id" DESC LIMIT $1  [["LIMIT", 1]]
UPDATE "contactinfos" SET "content" = $1, "updated_at" = $2 WHERE "contactinfos"."id" = $3
---
   def update
    @contact = Contactinfo.last
    @contact.update(contact_params)