app/controllers/findus_controller.rb

SELECT  "findus".* FROM "findus" ORDER BY "findus"."id" DESC LIMIT $1  [["LIMIT", 1]]
UPDATE "findus" SET "content" = $1, "updated_at" = $2 WHERE "findus"."id" = $3
---
     def update
    @findus = Findu.last

      if @findus.update(findus_params)