app/controllers/images_controller.rb

INSERT INTO "images" ("source", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["source", "emrz3hldbbv9pmzjxvsf.jpg"], ["description", "asd"], ["created_at", "2018-04-10 12:18:25.286974"], ["updated_at", "2018-04-10 12:18:25.286974"]]
---
  def create
    @image = Image.new(photos_params)
    @image.save!

SELECT  "images".* FROM "images" WHERE "images"."id" = $1 LIMIT $2  [["id", 50], ["LIMIT", 1]]
DELETE FROM "images" WHERE "images"."id" = $1  [["id", 50]]
---
  def destroy
    @image = Image.find(params[:id])
    @image.destroy