app/controllers/news_controller.rb

   def update
    @news = News.last

      if @news.update(news_params)
---
SELECT  "news".* FROM "news" ORDER BY "news"."id" DESC LIMIT $1  [["LIMIT", 1]]
UPDATE "news" SET "content" = $1, "updated_at" = $2 WHERE "news"."id" = $3