app/controllers/pages_controller.rb

SELECT  "abouts".* FROM "abouts" ORDER BY "abouts"."id" DESC LIMIT $1  [["LIMIT", 1]]
SELECT  "news".* FROM "news" ORDER BY "news"."id" DESC LIMIT $1  [["LIMIT", 1]]
SELECT  "prices".* FROM "prices" ORDER BY "prices"."id" DESC LIMIT $1  [["LIMIT", 1]]
SELECT  "findus".* FROM "findus" ORDER BY "findus"."id" DESC LIMIT $1  [["LIMIT", 1]]
SELECT  "contactinfos".* FROM "contactinfos" ORDER BY "contactinfos"."id" DESC LIMIT $1  [["LIMIT", 1]]
---
  def about
    @pagetitle = "About Us"
    @about = About.last
    @news = News.last
    @prices = Price.last
    @findus = Findu.last
    @contact = Contactinfo.last

SELECT  "terms".* FROM "terms" ORDER BY "terms"."id" DESC LIMIT $1  [["LIMIT", 1]]
---
  def terms
    @terms = Term.last

SELECT  "abouts".* FROM "abouts" ORDER BY "abouts"."id" DESC LIMIT $1  [["LIMIT", 1]]
SELECT  "news".* FROM "news" ORDER BY "news"."id" DESC LIMIT $1  [["LIMIT", 1]]
SELECT  "findus".* FROM "findus" ORDER BY "findus"."id" DESC LIMIT $1  [["LIMIT", 1]]
SELECT  "contactinfos".* FROM "contactinfos" ORDER BY "contactinfos"."id" DESC LIMIT $1  [["LIMIT", 1]]
SELECT  "prices".* FROM "prices" ORDER BY "prices"."id" DESC LIMIT $1  [["LIMIT", 1]]
---
  def about_edit

    @about = About.last

    @news = News.last

    @findus = Findu.last

    @contactinfo = Contactinfo.last

    @price = Price.last

SELECT  "terms".* FROM "terms" ORDER BY "terms"."id" DESC LIMIT $1  [["LIMIT", 1]]
---
  def terms_edit
    @terms = Term.last