app/controllers/pages_controller.rb

  def about
    @pagetitle = "About Us"
    @news = News.first
    @prices = Price.first
    @findus = Findu.first
    @contact = Contactinfo.first
---
SELECT  "news".* FROM "news" ORDER BY "news"."id" ASC LIMIT $1  [["LIMIT", 1]]
SELECT  "prices".* FROM "prices" ORDER BY "prices"."id" ASC LIMIT $1  [["LIMIT", 1]]
SELECT  "findus".* FROM "findus" ORDER BY "findus"."id" ASC LIMIT $1  [["LIMIT", 1]]
SELECT  "contactinfos".* FROM "contactinfos" ORDER BY "contactinfos"."id" ASC LIMIT $1  [["LIMIT", 1]]