app/controllers/prices_controller.rb

    def update

    @price = Price.last
---
SELECT  "prices".* FROM "prices" ORDER BY "prices"."id" DESC LIMIT $1  [["LIMIT", 1]]