app/controllers/seasons_controller.rb

  def index
    @seasons = Season.all
---
SELECT "seasons".* FROM "seasons"