app/controllers/terms_controller.rb

SELECT  "terms".* FROM "terms" ORDER BY "terms"."id" DESC LIMIT $1  [["LIMIT", 1]]
UPDATE "terms" SET "content" = $1, "updated_at" = $2 WHERE "terms"."id" = $3
---
    def update

    @price = Term.last

      if @term.update(term_params)