app/views/images/index.html.erb


<% Image.all.each_with_index do |image, index| %>
---
SELECT "images".* FROM "images"