app/views/images/index_edit.html.erb

SELECT "images".* FROM "images"
---

<% Image.all.each do |image| %>