app/views/attractions/index_edit.html.erb

SELECT "attractions".* FROM "attractions"
---

    <% Attraction.all.each do |attraction| %>