app/views/attractions/view.html.erb


    <% Attraction.all.each do |attraction| %>
---
SELECT  "attractions".* FROM "attractions" ORDER BY "attractions"."id" ASC LIMIT $1  [["LIMIT", 1]]